src/Documents/ИТСервисы_УстановкаКвалификацииСотрудников/ИТСервисы_УстановкаКвалификацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_УстановкаКвалификацииСотрудников</name>
  <registerRecords>InformationRegister.ИТСервисы_КвалификацияСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксПроцентЗагрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_КвалификацияСотрудников/ИТСервисы_КвалификацияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КвалификацияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксПроцентЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИТСервисы_УстановкаКвалификацииСотрудников/ObjectModule.bsl
#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	// Включаем автоматическую запись движений
	Движения.ИТСервисы_КвалификацияСотрудников.Записывать = Истина;
	
	// Проходим циклом по табличной части "Состав"
	Для Каждого ТекСтрока Из Состав Цикл
		
		// Защита от пустых строк
		Если Не ЗначениеЗаполнено(ТекСтрока.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ИТСервисы_КвалификацияСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Роль = ТекСтрока.Роль;
		Движение.СтавкаЧас = ТекСтрока.СтавкаЧас;
		Движение.МаксПроцентЗагрузки = ТекСтрока.МаксПроцентЗагрузки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
